<h1>Manipulando dados ausentes</h1>

In [1]:
import numpy as np 
import pandas as pd

/var/folders/31/m46t9hpx2kq8y89bx7jdb8l00000gn/T/ipykernel_33009/118197663.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
df = pd.DataFrame(data={"a":[1, 2, np.nan], "b":[5, np.nan, np.nan], "c":[1, 2, 3]})
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna(axis=0) # drop rows with NaN

     a    b  c
0  1.0  5.0  1

In [7]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [10]:
df.dropna(axis=1, thresh=2, inplace=False) # drop columns with at least 2 NaN

     a  c
0  1.0  1
1  2.0  2
2  NaN  3

In [11]:
df.fillna(value=0)

     a    b  c
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [17]:
df["a"].fillna(value=df["a"].mean(), inplace=True)
df

/var/folders/31/m46t9hpx2kq8y89bx7jdb8l00000gn/T/ipykernel_33009/4101179887.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["a"].fillna(value=df["a"].mean(), inplace=True)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [18]:
df.ffill() # Substitui o valor NaN pelo valor anterior

     a    b  c
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3